#if 0
;
; Note: shader requires additional functionality:
;       Double-precision floating point
;       UAVs at every shader stage
;
; shader debug name: e7f3df341122b4d016fe46b3e23bab7a.pdb
; shader hash: e7f3df341122b4d016fe46b3e23bab7a
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; scene                             texture     i32         ras      T0             t0     1
; uav                                   UAV     f32          2d      U0             u0     1
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:32-i16:32-i32:32-i64:64-f16:32-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%struct.RaytracingAccelerationStructure = type { i32 }
%"class.RWTexture2D<vector<float, 4> >" = type { <4 x float> }
%struct.RayDesc = type { <3 x float>, float, <3 x float>, float }
%struct.Payload = type { <3 x float>, i32, i32 }
%dx.types.Handle = type { i8* }
%struct.BuiltInTriangleIntersectionAttributes = type { <2 x float> }

@"\01?scene@@3URaytracingAccelerationStructure@@A" = external constant %struct.RaytracingAccelerationStructure, align 4
@"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A" = external constant %"class.RWTexture2D<vector<float, 4> >", align 4
@dx.nothing.a = internal constant [1 x i32] zeroinitializer

; Function Attrs: nounwind

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !48, globals: !80)
!1 = !DIFile(filename: "shader.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !15, !24, !33}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 25, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 25, size: 96, align: 32, elements: !6, templateParams: !11)
!6 = !{!7, !9, !10}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 25, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !{!12, !13}
!12 = !DITemplateTypeParameter(name: "element", type: !8)
!13 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 3)
!14 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!15 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 41, baseType: !16)
!16 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 41, size: 128, align: 32, elements: !17, templateParams: !22)
!17 = !{!18, !19, !20, !21}
!18 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !16, file: !1, line: 41, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!22 = !{!12, !23}
!23 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 4)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 87, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 87, size: 96, align: 32, elements: !26, templateParams: !31)
!26 = !{!27, !29, !30}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, line: 87, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, line: 87, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, line: 87, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !13}
!32 = !DITemplateTypeParameter(name: "element", type: !28)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 89, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 89, size: 288, align: 32, elements: !35, templateParams: !45)
!35 = !{!36, !37, !38, !39, !40, !41, !42, !43, !44}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !34, file: !1, line: 89, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!45 = !{!12, !46, !47}
!46 = !DITemplateValueParameter(name: "row_count", type: !14, value: i32 3)
!47 = !DITemplateValueParameter(name: "col_count", type: !14, value: i32 3)
!48 = !{!49, !52, !62, !74, !78, !79}
!49 = !DISubprogram(name: "RayGeneration", linkageName: "\01?RayGeneration@@YAXXZ", scope: !1, file: !1, line: 18, type: !50, isLocal: false, isDefinition: true, scopeLine: 19, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @"\01?RayGeneration@@YAXXZ")
!50 = !DISubroutineType(types: !51)
!51 = !{null}
!52 = !DISubprogram(name: "Miss", linkageName: "\01?Miss@@YAXUPayload@@@Z", scope: !1, file: !1, line: 45, type: !53, isLocal: false, isDefinition: true, scopeLine: 46, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z")
!53 = !DISubroutineType(types: !54)
!54 = !{null, !55}
!55 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !56)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "Payload", file: !1, line: 1, size: 160, align: 32, elements: !57)
!57 = !{!58, !59, !61}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !56, file: !1, line: 3, baseType: !4, size: 96, align: 32)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "allowReflection", scope: !56, file: !1, line: 4, baseType: !60, size: 32, align: 32, offset: 96)
!60 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "missed", scope: !56, file: !1, line: 5, baseType: !60, size: 32, align: 32, offset: 128)
!62 = !DISubprogram(name: "ClosestHit", linkageName: "\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", scope: !1, file: !1, line: 60, type: !63, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z")
!63 = !DISubroutineType(types: !64)
!64 = !{null, !55, !65}
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "BuiltInTriangleIntersectionAttributes", file: !1, line: 53, size: 64, align: 32, elements: !66)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "barycentrics", scope: !65, file: !1, line: 53, baseType: !68, size: 64, align: 32)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 22, size: 64, align: 32, elements: !69, templateParams: !72)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !68, file: !1, line: 22, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!72 = !{!12, !73}
!73 = !DITemplateValueParameter(name: "element_count", type: !14, value: i32 2)
!74 = !DISubprogram(name: "HitCube", linkageName: "\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 82, type: !75, isLocal: false, isDefinition: true, scopeLine: 83, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{null, !55, !77}
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 22, baseType: !68)
!78 = !DISubprogram(name: "HitMirror", linkageName: "\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 99, type: !75, isLocal: false, isDefinition: true, scopeLine: 100, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubprogram(name: "HitFloor", linkageName: "\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z", scope: !1, file: !1, line: 119, type: !75, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!80 = !{!81, !83, !85, !89, !91, !92, !93, !94, !96, !98, !100, !101, !102, !103, !104, !105, !106, !107, !108}
!81 = !DIGlobalVariable(name: "RAY_FLAG_NONE", scope: !0, file: !1, line: 39, type: !82, isLocal: true, isDefinition: true, variable: i32 0)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!83 = !DIGlobalVariable(name: "scene", linkageName: "\01?scene@@3URaytracingAccelerationStructure@@A", scope: !0, file: !1, line: 8, type: !84, isLocal: false, isDefinition: true, variable: %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A")
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "RaytracingAccelerationStructure", file: !1, line: 8, size: 32, align: 32, elements: !2)
!85 = !DIGlobalVariable(name: "uav", linkageName: "\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 10, type: !86, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!86 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 10, size: 128, align: 32, elements: !2, templateParams: !87)
!87 = !{!88}
!88 = !DITemplateTypeParameter(name: "element", type: !16)
!89 = !DIGlobalVariable(name: "camera", scope: !0, file: !1, line: 12, type: !90, isLocal: true, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!91 = !DIGlobalVariable(name: "light", scope: !0, file: !1, line: 13, type: !90, isLocal: true, isDefinition: true)
!92 = !DIGlobalVariable(name: "skyTop", scope: !0, file: !1, line: 14, type: !90, isLocal: true, isDefinition: true)
!93 = !DIGlobalVariable(name: "skyBottom", scope: !0, file: !1, line: 15, type: !90, isLocal: true, isDefinition: true)
!94 = !DIGlobalVariable(name: "skyBottom.0", linkageName: "skyBottom.0", scope: !0, file: !1, line: 15, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !90, size: 32, align: 4)
!96 = !DIGlobalVariable(name: "camera.1", linkageName: "camera.1", scope: !0, file: !1, line: 12, type: !97, isLocal: false, isDefinition: true)
!97 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !90, size: 32, align: 4, offset: 32)
!98 = !DIGlobalVariable(name: "skyBottom.2", linkageName: "skyBottom.2", scope: !0, file: !1, line: 15, type: !99, isLocal: false, isDefinition: true)
!99 = !DIDerivedType(tag: DW_TAG_member, name: ".2", baseType: !90, size: 32, align: 4, offset: 64)
!100 = !DIGlobalVariable(name: "skyTop.2", linkageName: "skyTop.2", scope: !0, file: !1, line: 14, type: !99, isLocal: false, isDefinition: true)
!101 = !DIGlobalVariable(name: "skyTop.0", linkageName: "skyTop.0", scope: !0, file: !1, line: 14, type: !95, isLocal: false, isDefinition: true)
!102 = !DIGlobalVariable(name: "light.1", linkageName: "light.1", scope: !0, file: !1, line: 13, type: !97, isLocal: false, isDefinition: true)
!103 = !DIGlobalVariable(name: "camera.0", linkageName: "camera.0", scope: !0, file: !1, line: 12, type: !95, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "skyBottom.1", linkageName: "skyBottom.1", scope: !0, file: !1, line: 15, type: !97, isLocal: false, isDefinition: true)
!105 = !DIGlobalVariable(name: "camera.2", linkageName: "camera.2", scope: !0, file: !1, line: 12, type: !99, isLocal: false, isDefinition: true)
!106 = !DIGlobalVariable(name: "light.0", linkageName: "light.0", scope: !0, file: !1, line: 13, type: !95, isLocal: false, isDefinition: true)
!107 = !DIGlobalVariable(name: "skyTop.1", linkageName: "skyTop.1", scope: !0, file: !1, line: 14, type: !97, isLocal: false, isDefinition: true)
!108 = !DIGlobalVariable(name: "light.2", linkageName: "light.2", scope: !0, file: !1, line: 13, type: !99, isLocal: false, isDefinition: true)
!109 = !{i32 2, !"Dwarf Version", i32 4}
!110 = !{i32 2, !"Debug Info Version", i32 3}
!111 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
!112 = !{!"shader.hlsl", !"struct Payload\0D\0A{\0D\0A\09float3 color;\0D\0A\09bool allowReflection;\0D\0A\09bool missed;\0D\0A};\0D\0A\0D\0ARaytracingAccelerationStructure scene : register(t0);\0D\0A\0D\0ARWTexture2D<float4> uav : register(u0);\0D\0A\0D\0Astatic const float3 camera = float3(0, 1.5, -7);\0D\0Astatic const float3 light = float3(0, 200, 0);\0D\0Astatic const float3 skyTop = float3(0.24, 0.44, 0.72);\0D\0Astatic const float3 skyBottom = float3(0.75, 0.86, 0.93);\0D\0A\0D\0A[shader(\22raygeneration\22)]\0D\0Avoid RayGeneration()\0D\0A{\0D\0A\0D\0A\09uint2 idx = DispatchRaysIndex().xy;\0D\0A\09float2 size = DispatchRaysDimensions().xy;\0D\0A\0D\0A\09float2 uv = idx / size;\0D\0A\09float3 target = float3((uv.x * 2 - 1) * 1.8 * (size.x / size.y),\0D\0A                           (1 - uv.y) * 4 - 2 + camera.y,\0D\0A                           0);\0D\0A\0D\0A\09RayDesc ray;\0D\0A\09ray.Origin = camera;\0D\0A\09ray.Direction = target - camera;\0D\0A\09ray.TMin = 0.001;\0D\0A\09ray.TMax = 1000;\0D\0A\0D\0A\09Payload payload;\0D\0A\09payload.allowReflection = true;\0D\0A\09payload.missed = false;\0D\0A\0D\0A\09TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, ray, payload);\0D\0A\0D\0A\09uav[idx] = float4(payload.color, 1);\0D\0A}\0D\0A\0D\0A[shader(\22miss\22)]\0D\0Avoid Miss(inout Payload payload)\0D\0A{\0D\0A\0D\0A\09float slope = normalize(WorldRayDirection()).y;\0D\0A\09float t = saturate(slope * 5 + 0.5);\0D\0A\09payload.color = lerp(skyBottom, skyTop, t);\0D\0A\0D\0A\09payload.missed = true;\0D\0A}\0D\0A\0D\0Avoid HitCube(inout Payload payload, float2 uv);\0D\0Avoid HitMirror(inout Payload payload, float2 uv);\0D\0Avoid HitFloor(inout Payload payload, float2 uv);\0D\0A\0D\0A[shader(\22closesthit\22)]\0D\0Avoid ClosestHit(inout Payload payload,\0D\0A                BuiltInTriangleIntersectionAttributes attrib)\0D\0A{\0D\0A\0D\0A\09switch (InstanceID())\0D\0A\09{\0D\0A\09\09case 0:\0D\0A\09\09\09HitCube(payload, attrib.barycentrics);\0D\0A\09\09\09break;\0D\0A\09\09case 1:\0D\0A\09\09\09HitMirror(payload, attrib.barycentrics);\0D\0A\09\09\09break;\0D\0A\09\09case 2:\0D\0A\09\09\09HitFloor(payload, attrib.barycentrics);\0D\0A\09\09\09break;\0D\0A\0D\0A\09\09default:\0D\0A\09\09\09payload.color = float3(1, 0, 1);\0D\0A\09\09\09break;\0D\0A\09}\0D\0A}\0D\0A\0D\0Avoid HitCube(inout Payload payload, float2 uv)\0D\0A{\0D\0A\09uint tri = PrimitiveIndex();\0D\0A\0D\0A\09tri /= 2;\0D\0A\09float3 normal = (tri.xxx % 3 == uint3(0, 1, 2)) * (tri < 3 ? -1 : 1);\0D\0A\0D\0A\09float3 worldNormal = normalize(mul(normal, (float3x3) ObjectToWorld4x3()));\0D\0A\0D\0A\09float3 color = abs(normal) / 3 + 0.5;\0D\0A\09if (uv.x < 0.03 || uv.y < 0.03)\0D\0A\09\09color = 0.25.xxx;\0D\0A\0D\0A\09color *= saturate(dot(worldNormal, normalize(light))) + 0.33;\0D\0A\09payload.color = color;\0D\0A}\0D\0A\0D\0Avoid HitMirror(inout Payload payload, float2 uv)\0D\0A{\0D\0A\09if (!payload.allowReflection)\0D\0A\09\09return;\0D\0A\0D\0A\09float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A\09float3 normal = normalize(mul(float3(0, 1, 0), (float3x3) ObjectToWorld4x3()));\0D\0A\09float3 reflected = reflect(normalize(WorldRayDirection()), normal);\0D\0A\0D\0A\09RayDesc mirrorRay;\0D\0A\09mirrorRay.Origin = pos;\0D\0A\09mirrorRay.Direction = reflected;\0D\0A\09mirrorRay.TMin = 0.001;\0D\0A\09mirrorRay.TMax = 1000;\0D\0A\0D\0A\09payload.allowReflection = false;\0D\0A\09TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, mirrorRay, payload);\0D\0A\0D\0A}\0D\0A\0D\0Avoid HitFloor(inout Payload payload, float2 uv)\0D\0A{\0D\0A\09float3 pos = WorldRayOrigin() + WorldRayDirection() * RayTCurrent();\0D\0A\0D\0A\09bool2 pattern = frac(pos.xz) > 0.5;\0D\0A\09payload.color = pattern.x ^ pattern.y ? 0.6.xxx : 0.4.xxx;\0D\0A\0D\0A\09RayDesc shadowRay;\0D\0A\09shadowRay.Origin = pos;\0D\0A\09shadowRay.Direction = light - pos;\0D\0A\09shadowRay.TMin = 0.001;\0D\0A\09shadowRay.TMax = 1;\0D\0A\0D\0A\09Payload shadow;\0D\0A\09shadow.allowReflection = false;\0D\0A\09shadow.missed = false;\0D\0A\09TraceRay(scene, RAY_FLAG_NONE, 0xFF, 0, 0, 0, shadowRay, shadow);\0D\0A\0D\0A\09if (!shadow.missed)\0D\0A\09\09payload.color /= 2;\0D\0A}\0D\0A\0D\0A"}
!113 = !{!"shader.hlsl"}
!114 = !{!"-E", !"lib.no::entry", !"-T", !"lib_6_3", !"/Fo", !"D:\5CWorkspace\5CGithub\5Cdxr_tutorial_2\5Cx64\5CDebug\5Cshader.cso", !"/Od", !"/Zi", !"/Qembed_debug"}
!115 = !{i32 1, i32 3}
!116 = !{i32 1, i32 6}
!117 = !{!"lib", i32 6, i32 3}
!118 = !{!119, !122, null, null}
!119 = !{!120}
!120 = !{i32 0, %struct.RaytracingAccelerationStructure* @"\01?scene@@3URaytracingAccelerationStructure@@A", !"scene", i32 0, i32 0, i32 1, i32 16, i32 0, !121}
!121 = !{i32 0, i32 4}
!122 = !{!123}
!123 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* @"\01?uav@@3V?$RWTexture2D@V?$vector@M$03@@@@A", !"uav", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !124}
!124 = !{i32 0, i32 9}
!125 = !{i32 0, %struct.RayDesc undef, !126, %struct.Payload undef, !131, %struct.BuiltInTriangleIntersectionAttributes undef, !135}
!126 = !{i32 32, !127, !128, !129, !130}
!127 = !{i32 6, !"Origin", i32 3, i32 0, i32 7, i32 9}
!128 = !{i32 6, !"TMin", i32 3, i32 12, i32 7, i32 9}
!129 = !{i32 6, !"Direction", i32 3, i32 16, i32 7, i32 9}
!130 = !{i32 6, !"TMax", i32 3, i32 28, i32 7, i32 9}
!131 = !{i32 20, !132, !133, !134}
!132 = !{i32 6, !"color", i32 3, i32 0, i32 7, i32 9}
!133 = !{i32 6, !"allowReflection", i32 3, i32 12, i32 7, i32 1}
!134 = !{i32 6, !"missed", i32 3, i32 16, i32 7, i32 1}
!135 = !{i32 8, !136}
!136 = !{i32 6, !"barycentrics", i32 3, i32 0, i32 7, i32 9}
!137 = !{i32 1, void ()* @"\01?RayGeneration@@YAXXZ", !138, void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !140, void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !142}
!138 = !{!139}
!139 = !{i32 1, !2, !2}
!140 = !{!139, !141}
!141 = !{i32 2, !2, !2}
!142 = !{!139, !141, !143}
!143 = !{i32 0, !2, !2}
!144 = !{null, !"", null, !118, !145}
!145 = !{i32 0, i64 65541}
!146 = !{void (%struct.Payload*, %struct.BuiltInTriangleIntersectionAttributes*)* @"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", !"\01?ClosestHit@@YAXUPayload@@UBuiltInTriangleIntersectionAttributes@@@Z", null, null, !147}
!147 = !{i32 8, i32 10, i32 6, i32 20, i32 7, i32 8, i32 5, !148}
!148 = !{i32 0}
!149 = !{void (%struct.Payload*)* @"\01?Miss@@YAXUPayload@@@Z", !"\01?Miss@@YAXUPayload@@@Z", null, null, !150}
!150 = !{i32 8, i32 11, i32 6, i32 20, i32 5, !148}
!151 = !{void ()* @"\01?RayGeneration@@YAXXZ", !"\01?RayGeneration@@YAXXZ", null, null, !152}
!152 = !{i32 8, i32 7, i32 5, !148}
!153 = !DILocation(line: 39, column: 2, scope: !49)
!154 = !DILocation(line: 41, column: 2, scope: !49)
!155 = !DILocation(line: 21, column: 14, scope: !49)
!156 = !DILocation(line: 21, column: 8, scope: !49)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "idx", scope: !49, file: !1, line: 21, type: !158)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 21, baseType: !159)
!159 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 21, size: 64, align: 32, elements: !160, templateParams: !163)
!160 = !{!161, !162}
!161 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !159, file: !1, line: 21, baseType: !28, size: 32, align: 32, flags: DIFlagPublic)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !159, file: !1, line: 21, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!163 = !{!32, !73}
!164 = !DIExpression(DW_OP_bit_piece, 0, 32)
!165 = !DIExpression(DW_OP_bit_piece, 32, 32)
!166 = !DILocation(line: 22, column: 16, scope: !49)
!167 = !DILocation(line: 22, column: 9, scope: !49)
!168 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "size", scope: !49, file: !1, line: 22, type: !77)
!169 = !DILocation(line: 24, column: 14, scope: !49)
!170 = !DILocation(line: 24, column: 18, scope: !49)
!171 = !DILocation(line: 24, column: 9, scope: !49)
!172 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "uv", scope: !49, file: !1, line: 24, type: !77)
!173 = !DILocation(line: 25, column: 31, scope: !49)
!174 = !DILocation(line: 25, column: 35, scope: !49)
!175 = !DILocation(line: 25, column: 40, scope: !49)
!176 = !DILocation(line: 25, column: 56, scope: !49)
!177 = !DILocation(line: 25, column: 46, scope: !49)
!178 = !DILocation(line: 26, column: 31, scope: !49)
!179 = !DILocation(line: 26, column: 39, scope: !49)
!180 = !DILocation(line: 26, column: 43, scope: !49)
!181 = !DILocation(line: 26, column: 49, scope: !49)
!182 = !DILocation(line: 26, column: 47, scope: !49)
!183 = !DILocation(line: 25, column: 9, scope: !49)
!184 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "target", scope: !49, file: !1, line: 25, type: !4)
!185 = !DIExpression(DW_OP_bit_piece, 64, 32)
!186 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ray", scope: !49, file: !1, line: 29, type: !187)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "RayDesc", file: !1, line: 29, size: 256, align: 32, elements: !188)
!188 = !{!189, !190, !191, !192}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "Origin", scope: !187, file: !1, line: 29, baseType: !5, size: 96, align: 32)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "TMin", scope: !187, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 96)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "Direction", scope: !187, file: !1, line: 29, baseType: !5, size: 96, align: 32, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "TMax", scope: !187, file: !1, line: 29, baseType: !8, size: 32, align: 32, offset: 224)
!193 = !DIExpression()
!194 = !DILocation(line: 29, column: 10, scope: !49)
!195 = !DILocation(line: 30, column: 15, scope: !49)
!196 = !DILocation(line: 30, column: 6, scope: !49)
!197 = !DILocation(line: 30, column: 13, scope: !49)
!198 = !DILocation(line: 31, column: 27, scope: !49)
!199 = !DILocation(line: 31, column: 25, scope: !49)
!200 = !DILocation(line: 31, column: 6, scope: !49)
!201 = !DILocation(line: 31, column: 16, scope: !49)
!202 = !DILocation(line: 32, column: 6, scope: !49)
!203 = !DILocation(line: 32, column: 11, scope: !49)
!204 = !DILocation(line: 33, column: 6, scope: !49)
!205 = !DILocation(line: 33, column: 11, scope: !49)
!206 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "payload", scope: !49, file: !1, line: 35, type: !56)
!207 = !DILocation(line: 35, column: 10, scope: !49)
!208 = !DILocation(line: 36, column: 10, scope: !49)
!209 = !DILocation(line: 36, column: 26, scope: !49)
!210 = !DILocation(line: 37, column: 10, scope: !49)
!211 = !DILocation(line: 37, column: 17, scope: !49)
!212 = !DILocation(line: 41, column: 28, scope: !49)
!213 = !DILocation(line: 41, column: 19, scope: !49)
!214 = !DILocation(line: 41, column: 11, scope: !49)
!215 = !DILocation(line: 42, column: 1, scope: !49)
!216 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !52, file: !1, line: 45, type: !56)
!217 = !DIExpression(DW_OP_bit_piece, 96, 32)
!218 = !DILocation(line: 45, column: 25, scope: !52)
!219 = !DILocation(line: 48, column: 26, scope: !52)
!220 = !DILocation(line: 48, column: 16, scope: !52)
!221 = !DILocation(line: 48, column: 8, scope: !52)
!222 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "slope", scope: !52, file: !1, line: 48, type: !8)
!223 = !DILocation(line: 49, column: 27, scope: !52)
!224 = !DILocation(line: 49, column: 31, scope: !52)
!225 = !DILocation(line: 49, column: 12, scope: !52)
!226 = !DILocation(line: 49, column: 8, scope: !52)
!227 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "t", scope: !52, file: !1, line: 49, type: !8)
!228 = !DILocation(line: 50, column: 34, scope: !52)
!229 = !DILocation(line: 50, column: 23, scope: !52)
!230 = !DILocation(line: 50, column: 18, scope: !52)
!231 = !DILocation(line: 50, column: 16, scope: !52)
!232 = !DILocation(line: 52, column: 17, scope: !52)
!233 = !DIExpression(DW_OP_bit_piece, 128, 32)
!234 = !DILocation(line: 53, column: 1, scope: !52)
!235 = !DILocation(line: 135, column: 2, scope: !79, inlinedAt: !236)
!236 = distinct !DILocation(line: 73, column: 4, scope: !237)
!237 = distinct !DILexicalBlock(scope: !62, file: !1, line: 65, column: 2)
!238 = !{!239}
!239 = distinct !{!239, !240, !"\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!240 = distinct !{!240, !"\01?HitFloor@@YAXUPayload@@V?$vector@M$01@@@Z"}
!241 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "attrib", arg: 2, scope: !62, file: !1, line: 61, type: !65)
!242 = !DILocation(line: 61, column: 55, scope: !62)
!243 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !62, file: !1, line: 60, type: !56)
!244 = !DILocation(line: 60, column: 31, scope: !62)
!245 = !DILocation(line: 64, column: 10, scope: !62)
!246 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "mirrorRay", scope: !78, file: !1, line: 108, type: !187)
!247 = !DILocation(line: 108, column: 10, scope: !78, inlinedAt: !248)
!248 = distinct !DILocation(line: 70, column: 4, scope: !237)
!249 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shadowRay", scope: !79, file: !1, line: 126, type: !187)
!250 = !DILocation(line: 126, column: 10, scope: !79, inlinedAt: !236)
!251 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "shadow", scope: !79, file: !1, line: 132, type: !56)
!252 = !DILocation(line: 132, column: 10, scope: !79, inlinedAt: !236)
!253 = !DILocation(line: 64, column: 2, scope: !62)
!254 = !DILocation(line: 67, column: 28, scope: !237)
!255 = !DILocation(line: 67, column: 4, scope: !237)
!256 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "uv", arg: 2, scope: !74, file: !1, line: 82, type: !77)
!257 = !DILocation(line: 82, column: 44, scope: !74, inlinedAt: !258)
!258 = distinct !DILocation(line: 67, column: 4, scope: !237)
!259 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !74, file: !1, line: 82, type: !56)
!260 = !DILocation(line: 82, column: 28, scope: !74, inlinedAt: !258)
!261 = !DILocation(line: 84, column: 13, scope: !74, inlinedAt: !258)
!262 = !DILocation(line: 84, column: 7, scope: !74, inlinedAt: !258)
!263 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "tri", scope: !74, file: !1, line: 84, type: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 84, baseType: !28)
!265 = !DILocation(line: 86, column: 6, scope: !74, inlinedAt: !258)
!266 = !DILocation(line: 87, column: 27, scope: !74, inlinedAt: !258)
!267 = !DILocation(line: 87, column: 31, scope: !74, inlinedAt: !258)
!268 = !DILocation(line: 87, column: 18, scope: !74, inlinedAt: !258)
!269 = !DILocation(line: 87, column: 57, scope: !74, inlinedAt: !258)
!270 = !DILocation(line: 87, column: 52, scope: !74, inlinedAt: !258)
!271 = !DILocation(line: 87, column: 50, scope: !74, inlinedAt: !258)
!272 = !DILocation(line: 87, column: 9, scope: !74, inlinedAt: !258)
!273 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !74, file: !1, line: 87, type: !4)
!274 = !DILocation(line: 89, column: 56, scope: !74, inlinedAt: !258)
!275 = !DILocation(line: 89, column: 33, scope: !74, inlinedAt: !258)
!276 = !DILocation(line: 89, column: 23, scope: !74, inlinedAt: !258)
!277 = !DILocation(line: 89, column: 9, scope: !74, inlinedAt: !258)
!278 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "worldNormal", scope: !74, file: !1, line: 89, type: !4)
!279 = !DILocation(line: 91, column: 17, scope: !74, inlinedAt: !258)
!280 = !DILocation(line: 91, column: 29, scope: !74, inlinedAt: !258)
!281 = !DILocation(line: 91, column: 33, scope: !74, inlinedAt: !258)
!282 = !DILocation(line: 91, column: 9, scope: !74, inlinedAt: !258)
!283 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "color", scope: !74, file: !1, line: 91, type: !4)
!284 = !DILocation(line: 92, column: 6, scope: !285, inlinedAt: !258)
!285 = distinct !DILexicalBlock(scope: !74, file: !1, line: 92, column: 6)
!286 = !DILocation(line: 92, column: 11, scope: !285, inlinedAt: !258)
!287 = !DILocation(line: 92, column: 21, scope: !285, inlinedAt: !258)
!288 = !DILocation(line: 92, column: 26, scope: !285, inlinedAt: !258)
!289 = !DILocation(line: 92, column: 18, scope: !285, inlinedAt: !258)
!290 = !DILocation(line: 92, column: 6, scope: !74, inlinedAt: !258)
!291 = !DILocation(line: 93, column: 11, scope: !285, inlinedAt: !258)
!292 = !DILocation(line: 93, column: 9, scope: !285, inlinedAt: !258)
!293 = !DILocation(line: 93, column: 3, scope: !285, inlinedAt: !258)
!294 = !DILocation(line: 95, column: 47, scope: !74, inlinedAt: !258)
!295 = !DILocation(line: 95, column: 20, scope: !74, inlinedAt: !258)
!296 = !DILocation(line: 95, column: 11, scope: !74, inlinedAt: !258)
!297 = !DILocation(line: 95, column: 56, scope: !74, inlinedAt: !258)
!298 = !DILocation(line: 95, column: 8, scope: !74, inlinedAt: !258)
!299 = !DILocation(line: 96, column: 10, scope: !74, inlinedAt: !258)
!300 = !DILocation(line: 96, column: 16, scope: !74, inlinedAt: !258)
!301 = !{!302}
!302 = distinct !{!302, !303, !"\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!303 = distinct !{!303, !"\01?HitCube@@YAXUPayload@@V?$vector@M$01@@@Z"}
!304 = !DILocation(line: 97, column: 1, scope: !74, inlinedAt: !258)
!305 = !DILocation(line: 68, column: 4, scope: !237)
!306 = !DILocation(line: 70, column: 4, scope: !237)
!307 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !78, file: !1, line: 99, type: !56)
!308 = !DILocation(line: 99, column: 30, scope: !78, inlinedAt: !248)
!309 = !DILocation(line: 101, column: 15, scope: !310, inlinedAt: !248)
!310 = distinct !DILexicalBlock(scope: !78, file: !1, line: 101, column: 6)
!311 = !{!312}
!312 = distinct !{!312, !313, !"\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z: %payload"}
!313 = distinct !{!313, !"\01?HitMirror@@YAXUPayload@@V?$vector@M$01@@@Z"}
!314 = !DILocation(line: 101, column: 6, scope: !78, inlinedAt: !248)
!315 = !DILocation(line: 102, column: 3, scope: !310, inlinedAt: !248)
!316 = !DILocation(line: 104, column: 15, scope: !78, inlinedAt: !248)
!317 = !DILocation(line: 104, column: 34, scope: !78, inlinedAt: !248)
!318 = !DILocation(line: 104, column: 56, scope: !78, inlinedAt: !248)
!319 = !DILocation(line: 104, column: 54, scope: !78, inlinedAt: !248)
!320 = !DILocation(line: 104, column: 32, scope: !78, inlinedAt: !248)
!321 = !DILocation(line: 104, column: 9, scope: !78, inlinedAt: !248)
!322 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !78, file: !1, line: 104, type: !4)
!323 = !DILocation(line: 105, column: 60, scope: !78, inlinedAt: !248)
!324 = !DILocation(line: 105, column: 28, scope: !78, inlinedAt: !248)
!325 = !DILocation(line: 105, column: 18, scope: !78, inlinedAt: !248)
!326 = !DILocation(line: 105, column: 9, scope: !78, inlinedAt: !248)
!327 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "normal", scope: !78, file: !1, line: 105, type: !4)
!328 = !DILocation(line: 106, column: 39, scope: !78, inlinedAt: !248)
!329 = !DILocation(line: 106, column: 29, scope: !78, inlinedAt: !248)
!330 = !DILocation(line: 106, column: 21, scope: !78, inlinedAt: !248)
!331 = !DILocation(line: 106, column: 9, scope: !78, inlinedAt: !248)
!332 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "reflected", scope: !78, file: !1, line: 106, type: !4)
!333 = !DILocation(line: 109, column: 12, scope: !78, inlinedAt: !248)
!334 = !DILocation(line: 109, column: 19, scope: !78, inlinedAt: !248)
!335 = !DILocation(line: 110, column: 12, scope: !78, inlinedAt: !248)
!336 = !DILocation(line: 110, column: 22, scope: !78, inlinedAt: !248)
!337 = !DILocation(line: 111, column: 12, scope: !78, inlinedAt: !248)
!338 = !DILocation(line: 111, column: 17, scope: !78, inlinedAt: !248)
!339 = !DILocation(line: 112, column: 12, scope: !78, inlinedAt: !248)
!340 = !DILocation(line: 112, column: 17, scope: !78, inlinedAt: !248)
!341 = !DILocation(line: 114, column: 10, scope: !78, inlinedAt: !248)
!342 = !DILocation(line: 114, column: 26, scope: !78, inlinedAt: !248)
!343 = !DILocation(line: 115, column: 2, scope: !78, inlinedAt: !248)
!344 = !DILocation(line: 117, column: 1, scope: !78, inlinedAt: !248)
!345 = !DILocation(line: 71, column: 4, scope: !237)
!346 = !DILocation(line: 73, column: 4, scope: !237)
!347 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "payload", arg: 1, scope: !79, file: !1, line: 119, type: !56)
!348 = !DILocation(line: 119, column: 29, scope: !79, inlinedAt: !236)
!349 = !DILocation(line: 121, column: 15, scope: !79, inlinedAt: !236)
!350 = !DILocation(line: 121, column: 34, scope: !79, inlinedAt: !236)
!351 = !DILocation(line: 121, column: 56, scope: !79, inlinedAt: !236)
!352 = !DILocation(line: 121, column: 54, scope: !79, inlinedAt: !236)
!353 = !DILocation(line: 121, column: 32, scope: !79, inlinedAt: !236)
!354 = !DILocation(line: 121, column: 9, scope: !79, inlinedAt: !236)
!355 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !79, file: !1, line: 121, type: !4)
!356 = !DILocation(line: 123, column: 18, scope: !79, inlinedAt: !236)
!357 = !DILocation(line: 123, column: 31, scope: !79, inlinedAt: !236)
!358 = !DILocation(line: 123, column: 8, scope: !79, inlinedAt: !236)
!359 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pattern", scope: !79, file: !1, line: 123, type: !360)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "bool2", file: !1, line: 123, baseType: !361)
!361 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<bool, 2>", file: !1, line: 123, size: 64, align: 32, elements: !362, templateParams: !365)
!362 = !{!363, !364}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !361, file: !1, line: 123, baseType: !60, size: 32, align: 32, flags: DIFlagPublic)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !361, file: !1, line: 123, baseType: !60, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!365 = !{!366, !73}
!366 = !DITemplateTypeParameter(name: "element", type: !60)
!367 = !DILocation(line: 124, column: 18, scope: !79, inlinedAt: !236)
!368 = !DILocation(line: 124, column: 30, scope: !79, inlinedAt: !236)
!369 = !DILocation(line: 124, column: 28, scope: !79, inlinedAt: !236)
!370 = !DILocation(line: 124, column: 42, scope: !79, inlinedAt: !236)
!371 = !DILocation(line: 124, column: 52, scope: !79, inlinedAt: !236)
!372 = !DILocation(line: 124, column: 10, scope: !79, inlinedAt: !236)
!373 = !DILocation(line: 124, column: 16, scope: !79, inlinedAt: !236)
!374 = !DILocation(line: 127, column: 12, scope: !79, inlinedAt: !236)
!375 = !DILocation(line: 127, column: 19, scope: !79, inlinedAt: !236)
!376 = !DILocation(line: 128, column: 24, scope: !79, inlinedAt: !236)
!377 = !DILocation(line: 128, column: 30, scope: !79, inlinedAt: !236)
!378 = !DILocation(line: 128, column: 12, scope: !79, inlinedAt: !236)
!379 = !DILocation(line: 128, column: 22, scope: !79, inlinedAt: !236)
!380 = !DILocation(line: 129, column: 12, scope: !79, inlinedAt: !236)
!381 = !DILocation(line: 129, column: 17, scope: !79, inlinedAt: !236)
!382 = !DILocation(line: 130, column: 12, scope: !79, inlinedAt: !236)
!383 = !DILocation(line: 130, column: 17, scope: !79, inlinedAt: !236)
!384 = !DILocation(line: 133, column: 9, scope: !79, inlinedAt: !236)
!385 = !DILocation(line: 133, column: 25, scope: !79, inlinedAt: !236)
!386 = !DILocation(line: 134, column: 9, scope: !79, inlinedAt: !236)
!387 = !DILocation(line: 134, column: 16, scope: !79, inlinedAt: !236)
!388 = !DILocation(line: 137, column: 14, scope: !389, inlinedAt: !236)
!389 = distinct !DILexicalBlock(scope: !79, file: !1, line: 137, column: 6)
!390 = !DILocation(line: 137, column: 6, scope: !79, inlinedAt: !236)
!391 = !DILocation(line: 138, column: 11, scope: !389, inlinedAt: !236)
!392 = !DILocation(line: 138, column: 17, scope: !389, inlinedAt: !236)
!393 = !DILocation(line: 138, column: 3, scope: !389, inlinedAt: !236)
!394 = !DILocation(line: 139, column: 1, scope: !79, inlinedAt: !236)
!395 = !DILocation(line: 74, column: 4, scope: !237)
!396 = !DILocation(line: 77, column: 12, scope: !237)
!397 = !DILocation(line: 77, column: 18, scope: !237)
!398 = !DILocation(line: 78, column: 4, scope: !237)
!399 = !DILocation(line: 80, column: 1, scope: !62)

#endif

const unsigned char compiledShader[] = {
  0x44, 0x58, 0x42, 0x43, 0xf4, 0xb8, 0x9a, 0x87, 0x74, 0x67, 0x83, 0x78,
  0xbc, 0xc4, 0xe3, 0xbc, 0x40, 0x88, 0xab, 0x97, 0x01, 0x00, 0x00, 0x00,
  0x5c, 0x70, 0x00, 0x00, 0x07, 0x00, 0x00, 0x00, 0x3c, 0x00, 0x00, 0x00,
  0x4c, 0x00, 0x00, 0x00, 0x14, 0x02, 0x00, 0x00, 0x38, 0x4e, 0x00, 0x00,
  0x00, 0x59, 0x00, 0x00, 0x34, 0x59, 0x00, 0x00, 0x50, 0x59, 0x00, 0x00,
  0x53, 0x46, 0x49, 0x30, 0x08, 0x00, 0x00, 0x00, 0x05, 0x00, 0x00, 0x00,
  0x00, 0x00, 0x00, 0x00, 0x52, 0x44, 0x41, 0x54, 0xc0, 0x01, 0x00, 0x00,
  0x10, 0x00, 0x00, 0x00, 0x04, 0x00, 0x00, 0x00, 0x18, 0x00, 0x00, 0x00,
  0xc0, 0x00, 0x00, 0x00, 0x10, 0x01, 0x00, 0x00, 0xa4, 0x01, 0x00, 0x00,
  0x01, 0x00, 0x00, 0x00, 0xa0, 0x00, 0x00, 0x00, 0x00, 0x73, 0x63, 0x65,
  0x6e, 0x65, 0x00, 0x75, 0x61, 0x76, 0x00, 0x01, 0x3f, 0x52, 0x61, 0x79,
  0x47, 0x65, 0x6e, 0x65, 0x72, 0x61, 0x74, 0x69, 0x6f, 0x6e, 0x40, 0x40,
  0x59, 0x41, 0x58, 0x58, 0x5a, 0x00, 0x52, 0x61, 0x79, 0x47, 0x65, 0x6e,
  0x65, 0x72, 0x61, 0x74, 0x69, 0x6f, 0x6e, 0x00, 0x01, 0x3f, 0x4d, 0x69,
  0x73, 0x73, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x50, 0x61, 0x79, 0x6c,
  0x6f, 0x61, 0x64, 0x40, 0x40, 0x40, 0x5a, 0x00, 0x4d, 0x69, 0x73, 0x73,
  0x00, 0x01, 0x3f, 0x43, 0x6c, 0x6f, 0x73, 0x65, 0x73, 0x74, 0x48, 0x69,
  0x74, 0x40, 0x40, 0x59, 0x41, 0x58, 0x55, 0x50, 0x61, 0x79, 0x6c, 0x6f,
  0x61, 0x64, 0x40, 0x40, 0x55, 0x42, 0x75, 0x69, 0x6c, 0x74, 0x49, 0x6e,
  0x54, 0x72, 0x69, 0x61, 0x6e, 0x67, 0x6c, 0x65, 0x49, 0x6e, 0x74, 0x65,
